Revit 2027 API
CurveNode.GetCurve Method
 Returns the geometric curve object corresponding to the node.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Curve GetCurve()
Public Function GetCurve As Curve
public:
Curve^ GetCurve()
member GetCurve : unit -> Curve
Return Value
Curve
 The curve.
See Also
Reference
CurveNode Class
Autodesk.Revit.DB Namespace